{
    "navbar": {
        "home": "Inicio",
        "stack": "Dev Stack",
        "about": "Sobre mí",
        "projects": "Proyectos",
        "contact": "Contacto",
        "language": "Idioma"
    },
    "main": {
        "title": "Dearrollador Front-End",
        "subtitle": "Hola, soy Diego. Un ",
        "subtitle_2": "localizado en Colombia. 📍",
        "subtitle_highlighted": "apasionado desarrollador",
        "contact": "Encuéntrame en:"
    },
    "devStack": {
        "title": "Stack de Desarrollo",
        "subtitle": "Aquí hay algunas de algunas de las tecnologías que he utilizado recientemente:"
    },
    "about": {
        "title": "Sobre mi",
        "description": "¡Hola! Mi nombre es Diego Garcia y disfruto creando cosas que viven en internet. Mi interés en el desarrollo web comenzó en 2020 cuando decidí crear mis propios sitios web sobre cosas que me gustaban como videojuegos o artistas - ¡eso me enseñó mucho sobre HTML y CSS!",
        "description_2": "En la actualidad, me dedico principalmente a crear productos y experiencias digitales accesibles e inclusivos para diversos clientes.",
        "subtitle": "Educación",
        "education": {
            "title": "Análisis y Desarrollo de Software",
            "description": "Servicion Nacional de Aprendizaje (SENA)",
            "date": "2022 - 2024"
        },
        "jobs": {
            "title": "Experiencia Laboral",
            "1": {
                "company": "SuperGiros",
                "title": "Desarrollador de Software",
                "date": "Ago 2023 - Presente",
                "description": "Actualmente trabajo como Desarrollador de Software en SuperGiros, una empresa de servicios financieros. Mi trabajo consiste en crear y mantener aplicaciones web para uso interno y externo, así como también crear y mantener sitios web para la empresa."
            },
            "2": {
                "company": "Freelance",
                "title": "Desarrollador Front-End",
                "date": "Jul 2022 - Presente",
                "description": "He trabajado como desarrolador freelance por más de un año, principalmente para pequeñas empresas y organizaciones. He trabajado en una amplia gama de proyectos para clientes de todo el mundo."
            }
        }
    },
    "projects": {
        "title": "Proyectos Destacados",
        "data": {
            "filmpassport": {
                "title": "Film Passport",
                "description": "Film Passport es una aplicación web que permite a los usuarios navegar por películas populares, buscar películas y añadir películas a su lista de favoritos. Cada película tiene su propia página dedicada con una descripción, tráiler y películas similares recomendadas.",
                "live": "https://film-passport.netlify.app/",
                "repository": "https://github.com/Ripdiegozz/FilmPassport"
            },
            "bluebyte": {
                "title": "Bluebyte Shop",
                "description": "Este proyecto es un sitio web de comercio electrónico. Utiliza HTML, CSS, TailwindCSS, JavaScript, React.js, React Hooks, Next.js, Sanity y Stripe. El proyecto tiene un carrito de compras funcional, un selector de cantidad de productos y pagos realizados a través de Stripe.",
                "repository": "https://github.com/Ripdiegozz/BluebyteStore",
                "live": "https://bluebyte-store.vercel.app/"
            },
            "notewave": {
                "title": "Notewave",
                "description": "Notewave es tu universo digital personal para capturar inspiración e ideas. Es un espacio en el que puedes crear notas, documentos y listas con facilidad, y luego, con unos pocos clics, compartir tus creaciones con el mundo. Ya seas un pensador creativo, un planificador meticuloso o algo intermedio, Notewave se adapta a tu estilo único. Es una sinfonía de organización y creatividad, diseñada para potenciar tus pensamientos y simplificar tu vida digital. Con Notewave, tus ideas toman el centro del escenario, y el mundo es tu audiencia.",
                "repository": "https://github.com/Ripdiegozz/Notewave",
                "live": "https://notewave-lake.vercel.app/"
            },
            "todoapp": {
                "title": "Todo App",
                "description": "Una app de listas de tareas pendientes construida con HTML, CSS y JavaScript utilizando la API LocalStorage, que permite añadir una fecha límite para cada tarea y agruparlas por fechas, es una herramienta ideal para quienes necesitan tener un control más detallado de sus tareas pendientes.",
                "repository": "https://github.com/Ripdiegozz/TODO-app",
	            "live": "https://todo-app-mu-pink.vercel.app/"
            },
            "adviceMentor": {
                "title": "Advice Generator App",
                "description": "Este proyecto es una sencilla aplicación generadora de consejos construida con HTML, CSS y JavaScript. Utiliza la API Advice Slip JSON para obtener consejos aleatorios y mostrarlos en la página.",
                "repository": "https://github.com/Ripdiegozz/advice-generator-app",
	            "live": "https://advice-generator-app-ashen.vercel.app/"
            },
            "eden": {
                "title": "Eden",
                "description": "EDEN: una aplicación de chat orientada a la comunidad creada para dar vida a las conversaciones en un vibrante espacio virtual. Conéctese con amigos, comparta ideas y explore un nuevo ámbito de comunicación en línea. Únete hoy mismo a la experiencia EDEN.",
                "repository": "https://github.com/Ripdiegozz/Eden",
	            "live": "https://eden-production.up.railway.app/"
            }
        }
    },
    "contact": {
        "title": "¿Tienes una idea?",
        "subtitle": "¡Hablemos!"
    },
    "cv": {
        "url": "/CV_(ESP).pdf"
    }
}