{   
    
    "navbar": {
        "home": "Home",
        "stack": "Dev Stack",
        "about": "About",
        "projects": "Projects",
        "contact": "Contact",
        "language": "Language"
    },
    "main": {
        "title": "Front-End Developer",
        "subtitle": "Hi, I am Diego. A ",
        "subtitle_2": "based in Colombia. 📍",
        "subtitle_highlighted": "passionate developer",
        "contact": "Find me in:"
    },
    "devStack": {
        "title": "Development Stack",
        "subtitle": "There are some of the technologies I use for my projects."
    },
    "about": {
        "title": "About me",
        "description": "Hello! My name is Diego Garcia and I enjoy creating things that live on the internet. My interest in web development started back in 2020 when I decided to try creating my own websites about things, I like such as videogames or artists — that taught me a lot about HTML & CSS!",
        "description_2": "Fast-forward to today, my main focus these days is building accessible, inclusive products and digital experiences for a variety of clients.",
        "subtitle": "Education",
        "education": {
            "title": "Software Analysis and Development",
            "description": "Servicion Nacional de Aprendizaje (SENA)",
            "date": "2022 - 2024"
        },
        "jobs": {
            "title": "Work Experience",
            "1": {
                "company": "SuperGiros",
                "title": "Software Developer",
                "date": "Aug 2023 - Present",
                "description": "I'm currently working as a Software Developer at SuperGiros, a company that provides financial services to the Colombian population. I'm in charge of developing and maintaining the company's website, as well as developing new features for the company's internal applications."
            },
            "2": {
                "company": "Freelance",
                "title": "Front-End Developer",
                "date": "Aug 2021- Present",
                "description": "I've been working as a freelance developer for over a year now, mostly for small businesses and organizations. I've worked on a wide range of projects for clients all over the world."
            }
        }
    },
    "projects": {
        "title": "Featured Projects",
        "data": {
            "filmpassport": {
                "title": "Film Passport",
                "description": "Film Passport is a web application that allows users to browse popular movies, search for movies, and add movies to their favorites list. Each movie has its own dedicated page with a description, trailer, and recommended similar movies.",
                "live": "https://film-passport.netlify.app/",
                "repository": "https://github.com/Ripdiegozz/FilmPassport"
            },
            "bluebyte": {
                "title": "Bluebyte Shop",
                "description": "This project is an e-commerce website. It uses HTML, CSS, TailwindCSS, JavaScript, React.js, React Hooks, Next.js, Sanity and Stripe. The project has a functional shopping cart, a product quantity selector and payments made through Stripe.",
                "repository": "https://github.com/Ripdiegozz/BluebyteStore",
                "live": "https://bluebyte-store.vercel.app/"
            },
            "notewave": {
                "title": "Notewave",
                "description": "Notewave is your personal digital universe for capturing inspiration and ideas. It's a space where you can effortlessly craft notes, documents, and lists, and then, with a few clicks, share your creations with the world. Whether you're a creative thinker, a meticulous planner, or something in between, Notewave adapts to your unique style. It's a symphony of organization and creativity, designed to empower your thoughts and simplify your digital life. With Notewave, your ideas take center stage, and the world is your audience.",
                "repository": "https://github.com/Ripdiegozz/Notewave",
                "live": "https://notewave-lake.vercel.app/"
            },
            "todoapp": {
                "title": "Todo App",
                "description": "A to-do list app built with HTML, CSS, and JavaScript using the LocalStorage API, which allows adding a deadline for each task and grouping them by date, is an ideal tool for those who need to have a more detailed control of their pending tasks.",
                "repository": "https://github.com/Ripdiegozz/TODO-app",
	            "live": "https://todo-app-mu-pink.vercel.app/"
            },
            "adviceMentor": {
                "title": "Advice Generator App",
                "description": "This project is a simple advice generator app built with HTML, CSS, and JavaScript. It uses the Advice Slip JSON API to fetch random advice and display it on the page.",
                "repository": "https://github.com/Ripdiegozz/advice-generator-app",
	            "live": "https://advice-generator-app-ashen.vercel.app/"
            },
            "eden": {
                "title": "Eden",
                "description": "EDEN: A community-driven chat application built to bring conversations to life in a vibrant virtual space. Connect with friends, share ideas, and explore a new realm of online communication. Join the EDEN experience today!",
                "repository": "https://github.com/Ripdiegozz/Eden",
	            "live": "https://eden-production.up.railway.app/"
            }
        }
    },
    "contact": {
        "title": "Have an idea?",
        "subtitle": "Let's get in touch!"
    },
    "cv": {
        "url": "/CV.pdf"
    }
}
